[{ 
    "id" : 3,
    "date" : "August 8, 2024",
    "img" : "/ITEC3020/assignment2/assets/img/blog.png",
    "headline" : "JSON-powered blog",
    "teaser" : "How I changed the regular blog posts to use JSON data.",
    "body" : "<p>I had already implemented a basic blog on the site, which had a nice - but fancy - layout.  Now I had to change it to use JSON for the blog articles. The original blog had a same-page format, where the headline and the body were on the same page, using expand/collapse for the 'Read More' function.  It had a spotlight blog (the latest one) and then the other blogs were below it as smaller tiles with 2 side-by-side. I wanted to keep that format, but that made it harder for me than if they were just listed one under the other.<\/p><p>Creating the JSON file was straightforward because I already knew the various parts that I'd need based on the layout (including the 'teaser' that displays above the 'Read More' and the image that displays).  Programming the initial, spotlight blog entry was also not that difficult to do given the code provided for the Assignment.  However, the 2 side-by-side blogs were a real challenge. It required a number of flags to check whether the item was the first (spotlight) and to determine if it was the first or second of a pair row. Then, I had to create multiple nested container div's (new div Element contructs) to create the side-by-side display of the original code.  New variables were required  to preserve the object (blog's nested div) when it was the first entry and then create and display the new row with both blog objects when it was the second (and last) entry. I used both regular variables (for HTML code) and additional div Element contructs for these nested div's and their content.  Since the actual blog post HTML was the same for all items, I was able to create a sub-routine for that part (renderPost).<\/p><p>Honestly, it took some trial and error to add the right amount of nested divs to create the side-by-side display and I considered leaving it as a stack of spotlight-like entries.  In the end though, I prevailed, and it now shows 3 blogs, with one in the spotlight and the remaining as a side-by-side pair.<\/p>"
},{ 
    "id" : 2,
    "date" : "August 8, 2024",
    "img" : "/ITEC3020/assignment2/assets/img/day-night.jpg",
    "headline" : "Light-to-Dark Mode ",
    "teaser" : "How I implemented a light-to-dark view toggle on this site.",
    "body" : "<p>In my opinion, the simplest, most maintainable way to implement a view-mode toggle wass to make use of additional styles and classes.  After all, it is a display-layer feature.<\/p><p>Consequently, I created an additional class, called 'dark', that could be added to existing CSS selectors to create a unique combination of darker colours.<\/p><p>The 'light' site uses oranges, white and greys, so I kept the dark colours similar, with a burnt brown, black and kept the greys and orange where it made sense.<\/p><p>The most challenging part was how to keep the mode as the visitor moved from page to page.  First, I tried URL-encoding the mode (with ?mode=dark in URL), but this became too convoluted as the URLs also had hashes for the main resume part.  So I chose to use a cookie to hold the current-mode.  As each new page loads, it checks the cookie for the colour mode.  'Light' is the default if there is no cookie yet.  If you hit the toggle on any of the pages, then it will change the view and update the cookie.<\/p><p>This provides consistency as you move from page, with the simplest amount of code.<\/p>"
},{ 
    "id" : 1,
    "date" : "July 4, 2024",
    "img" : "/ITEC3020/assignment2/assets/img/replace-programmers2.jpg",
    "headline" : "Will my degree be obsolete?",
    "teaser" : "LLM's like ChatGPT can write better, cleaner code faster than a human.",
    "body" : "<p>The rapid advancement of AI in recent years has sparked concerns among IT professionals, particularly those with degrees in Information Technology, about the future relevance of their expertise. AI-powered tools and platforms have become increasingly sophisticated, capable of automating tasks that were once the exclusive domain of human programmers. This has led some to worry that their hard-earned degrees may become obsolete as AI continues to encroach upon the traditional roles and responsibilities of IT professionals.<\/p><p>Moreover, the development of AI models with the ability to generate code and troubleshoot software issues has raised questions about the long-term viability of programming as a profession. As AI becomes more adept at handling complex coding tasks, the demand for human programmers may dwindle, potentially leaving IT graduates with limited career prospects. The growing prevalence of AI-driven automation across various industries further exacerbates these concerns,as it may result in a reduced need for IT professionals to maintain and manage software systems.<\/p><p>However, it is important to note that while AI may significantly impact the IT landscape, it is unlikely to render IT degrees completely useless. Instead, it may necessitate a shift in focus for IT professionals, requiring them to develop new skills and expertise that complement AI capabilities. For example, IT graduates may need to specialize in areas such as AI ethics, data privacy, or cybersecurity, which are becoming increasingly important as AI becomes more integrated into society. Additionally, the ability to collaborate effectively with AI systems and leverage their strengths to enhance productivity will likely become a valuable asset for IT professionals in the future.<\/p>"
}]